# lambda

In [127]:
# Add numbers
add = lambda x, y: x + y
add(10, 20)

30

In [128]:
# check palindrom
is_palindrom = lambda x: True if x == x[::-1] else False

is_palindrom('NANA')

False

In [129]:
# check odd or even

check_odd_even = lambda x: 'Even' if x%2 == 0 else 'Odd'
check_odd_even(12)

'Even'

# List comprehension

In [130]:
a = [2, 3, 4, 5]
new_list = [x**2 for x in a]
new_list

[4, 9, 16, 25]

In [131]:
# compare 2 list

a = [1, 2, 3]
b = [1, 3, 2]
a.sort()
b.sort()
a == b

True

# Data frame

### install pandas

pip install pandas

In [132]:
a = {
  'name': ['Surya', 'Ajit', 'Kamal'],
  'age' : [49, 52, 60],
  'income': [100, 80, 90]
}

In [133]:
a

{'name': ['Surya', 'Ajit', 'Kamal'],
 'age': [49, 52, 60],
 'income': [100, 80, 90]}

In [134]:
import pandas as pd

## subsetting on data frame

- `iloc`: use it for index search
- `loc`: use it for row and column names

In [135]:
data = pd.DataFrame(a)

In [136]:
data

    name  age  income
0  Surya   49     100
1   Ajit   52      80
2  Kamal   60      90

In [137]:
data.iloc[0,] # find entire column

name      Surya
age          49
income      100
Name: 0, dtype: object

In [138]:
x = data.iloc[:,2] # entire income, `:` is everything
type(x) # pandas.core.series.Series

pandas.core.series.Series

In [139]:
# provides names to rows, we can use index names of `.loc``
data = pd.DataFrame(a, index = ['a', 'b', 'c'])

In [140]:
data

    name  age  income
a  Surya   49     100
b   Ajit   52      80
c  Kamal   60      90

In [141]:
# extract

In [142]:

data.loc['a','age'] = 29
data.loc['a','name'] = 'virat'

In [143]:
data

    name  age  income
a  virat   29     100
b   Ajit   52      80
c  Kamal   60      90

In [144]:
## search for perticular row

In [145]:
# data[data.name == 'Surya'].loc['a','age']

In [146]:


type(data[data.name == 'SURYA']['age'])
pd.Series

pandas.core.series.Series

In [147]:
# age greated than 25

data[data.age >= 25]

    name  age  income
a  virat   29     100
b   Ajit   52      80
c  Kamal   60      90

In [148]:
# iterrate data fram series
x = []
for i in data.name:
  x.append(i.upper())
x

['VIRAT', 'AJIT', 'KAMAL']

In [149]:
data.name

a    virat
b     Ajit
c    Kamal
Name: name, dtype: object

In [150]:
data.name = x

In [151]:
data

    name  age  income
a  VIRAT   29     100
b   AJIT   52      80
c  KAMAL   60      90

In [152]:
data['new_name'] = x

In [153]:
data

    name  age  income new_name
a  VIRAT   29     100    VIRAT
b   AJIT   52      80     AJIT
c  KAMAL   60      90    KAMAL

In [154]:
age_col = []

for x in data.age:
  if x % 2 == 0:
    age_col.append(True)
  else:
    age_col.append(False)
data['age_even_odd'] = age_col

In [155]:
data

    name  age  income new_name  age_even_odd
a  VIRAT   29     100    VIRAT         False
b   AJIT   52      80     AJIT          True
c  KAMAL   60      90    KAMAL          True

# to get description shortcut is shift tab

In [156]:
## drop the entire column

data.drop(columns=['name']) # ov view

   age  income new_name  age_even_odd
a   29     100    VIRAT         False
b   52      80     AJIT          True
c   60      90    KAMAL          True

In [157]:
data # stil name is not dropped

    name  age  income new_name  age_even_odd
a  VIRAT   29     100    VIRAT         False
b   AJIT   52      80     AJIT          True
c  KAMAL   60      90    KAMAL          True

In [158]:
# drop column permanenently

data.drop(columns=['name'], inplace = True)

In [159]:
data

   age  income new_name  age_even_odd
a   29     100    VIRAT         False
b   52      80     AJIT          True
c   60      90    KAMAL          True

In [160]:
# rename column
data.rename(columns={'age': 'new_age'}, inplace= True)

In [161]:
data

   new_age  income new_name  age_even_odd
a       29     100    VIRAT         False
b       52      80     AJIT          True
c       60      90    KAMAL          True

In [162]:
# drop the row
data.drop(index=['b'], inplace=True)

In [163]:
data

   new_age  income new_name  age_even_odd
a       29     100    VIRAT         False
c       60      90    KAMAL          True

In [166]:
# rename index
data.rename(index={'a': 'A'}, inplace=True)

In [167]:
data

   new_age  income new_name  age_even_odd
A       29     100    VIRAT         False
c       60      90    KAMAL          True

In [169]:
# change the position of columns

data = data[['new_name', 'age_even_odd', 'income', 'new_age']]

In [170]:
data

  new_name  age_even_odd  income  new_age
A    VIRAT         False     100       29
c    KAMAL          True      90       60

In [174]:
# print only few columns from data frame
data[['new_name', 'income']]

  new_name  income
A    VIRAT     100
c    KAMAL      90

In [177]:
data

  new_name  age_even_odd  income  new_age
A    VIRAT         False     100       29
c    KAMAL          True      90       60

In [180]:
data.iloc[:, 0]

A    VIRAT
c    KAMAL
Name: new_name, dtype: object

In [182]:

for i in data:
  print(data.loc[:, i])

A    VIRAT
c    KAMAL
Name: new_name, dtype: object
A    False
c     True
Name: age_even_odd, dtype: bool
A    100
c     90
Name: income, dtype: int64
A    29
c    60
Name: new_age, dtype: int64

In [183]:
data

  new_name  age_even_odd  income  new_age
A    VIRAT         False     100       29
c    KAMAL          True      90       60

In [188]:
data['new_col'] = data['income'] / data['new_age']

/var/folders/6r/86jpjbx9667_wsdjbp1ln2rc0000gn/T/ipykernel_2336/464193195.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['new_col'] = data['income'] / data['new_age']

In [189]:
data

  new_name  age_even_odd  income  new_age   new_col
A    VIRAT         False     100       29  3.448276
c    KAMAL          True      90       60  1.500000

In [190]:
new_row = {
  'new_name': 'Ajay',
  'age_even_odd': True,
  'income': 230,
  'new_col': 2.34
}
new_data = pd.DataFrame(data=new_row, index=['d'])

In [191]:
new_data

  new_name  age_even_odd  income  new_col
d     Ajay          True     230     2.34

In [192]:
data

  new_name  age_even_odd  income  new_age   new_col
A    VIRAT         False     100       29  3.448276
c    KAMAL          True      90       60  1.500000

In [ ]:
pd.concat([data, new_data], copy=False)

# axis

  new_name  age_even_odd  income  new_age   new_col
A    VIRAT         False     100     29.0  3.448276
c    KAMAL          True      90     60.0  1.500000
d     Ajay          True     230      NaN  2.340000

In [200]:
data

  new_name  age_even_odd  income  new_age   new_col
A    VIRAT         False     100       29  3.448276
c    KAMAL          True      90       60  1.500000

In [203]:
data

  new_name  age_even_odd  income  new_age   new_col
A    VIRAT         False     100       29  3.448276
c    KAMAL          True      90       60  1.500000

In [204]:
# concat using column wise

# use pd.concat([d1, d2], axis=0) # row by default
# pd.concate([d1, d2], axis=1) # column column